namespace Console_marketplace;
class Program
{
    /*      
    Основные функции:
      
    1. Работа с пользователями
    Возможность регистрации и входа в систему, с проверкой уникальности имени пользователя.
    Личный профиль: отображение инвентаря, история заказов, виртуальный баланс.
    Функция пополнения баланса для покупок.
    Разделение ролей: обычный пользователь и администратор (с разными правами доступа).

    2. Работа с товарами (гифками)
    Каталог доступных гифок с основной информацией(тип, номер, кто владеет, цена).
    Оформление заказа(аукцион по цене, продавец может согласиться на цену)
    Поиск товаров по названию.
    Фильтрация по типам и диапазону цен.

    3. Корзина и заказы
    Добавление и удаление товаров из корзины.
    Подсчёт итоговой суммы перед покупкой.
    Подтверждение покупки с последующим созданием заказа и фиксацией времени.

    4. Инвентарь пользователя
    Отображение списка всех приобретённых гифок.
    Возможность подарить гифку.
    Просмотр информации(тип, номер, название)
    
    5. Админ-функции
    Добавление новых гифок в каталог.
    Удаление или редактирование товаров.
    Просмотр статистики продаж (популярные гифки).
    Управление пользователями, включая возможность блокировки и просмотр всех возможных действий пользователей
    просмотр кто что у кого купил и когда
    */
        
    static void Main()
    {
      
    }
    
}